[GT_AimedShot X2AbilityTemplate]
LocFriendlyName="Aimed Shot"
LocHelpText="Take carefully aimed point fire at the target."

[GT_SnapShot X2AbilityTemplate]
LocFriendlyName="Snap Shot"
LocHelpText="Take hastily aimed point fire at the target."

[GT_OverwatchSnap X2AbilityTemplate]
LocFriendlyName="Overwatch"
LocHelpText="React to movement with point fire."

[GT_VolumeShot X2AbilityTemplate]
LocFriendlyName="Volume of Fire"
LocHelpText="Lay prolonged fire at the target."

[GT_ThrowGrenade X2AbilityTemplate]
LocFriendlyName="Throw Grenade"
LocHelpText="Prime and throw grenade immediately. Will explode the following turn."

[GT_ThrowPrimedGrenade X2AbilityTemplate]
LocFriendlyName="Throw Primed Grenade"
LocHelpText="Throw primed grenade immediately. Will explode on contact."

[GT_PrimeGrenade X2AbilityTemplate]
LocFriendlyName="Prime Grenade"
LocHelpText="Prime grenade. Will be forced to throw grenade immediately next turn."

[AdvRifleman X2CharacterTemplate]
strCharacterName="ADVENT Rifleman"

[AdvGunner X2CharacterTemplate]
strCharacterName="ADVENT Gunner"

[AdvCaptain X2CharacterTemplate]
strCharacterName="ADVENT Captain"

[AdvMedic X2CharacterTemplate]
strCharacterName="ADVENT Medic"

[AdvLancer X2CharacterTemplate]
strCharacterName="ADVENT Lancer"

[AdvSharpshooter X2CharacterTemplate]
strCharacterName="ADVENT Sharpshooter"

[AdvBreacher X2CharacterTemplate]
strCharacterName="ADVENT Breacher"

[AdvRiotTrooper X2CharacterTemplate]
strCharacterName="ADVENT Riot Trooper"


[Pistol_Advent X2WeaponTemplate]
FriendlyName="ADVENT Pistol"
FriendlyNamePlural="ADVENT Pistols"
BriefSummary=""
TacticalText=""
AbilityDescName="pistol"

[AssaultRifle_Advent X2WeaponTemplate]
FriendlyName="ADVENT Assault Rifle"
FriendlyNamePlural="ADVENT Assault Rifles"
BriefSummary=""
TacticalText=""
AbilityDescName="assault rifle"

[SMG_Advent X2WeaponTemplate]
FriendlyName="ADVENT Submachine Gun"
FriendlyNamePlural="ADVENT Submachine Guns"
BriefSummary=""
TacticalText=""
AbilityDescName="smg"

[SniperRifle_Advent X2WeaponTemplate]
FriendlyName="ADVENT Sniper Rifle"
FriendlyNamePlural="ADVENT Sniper Rifles"
BriefSummary=""
TacticalText=""
AbilityDescName="sniper rifle"

[Cannon_Advent X2WeaponTemplate]
FriendlyName="ADVENT Cannon"
FriendlyNamePlural="ADVENT Cannons"
BriefSummary=""
TacticalText=""
AbilityDescName="cannon"

[Shotgun_Advent X2WeaponTemplate]
FriendlyName="ADVENT Shotgun"
FriendlyNamePlural="ADVENT Shotguns"
BriefSummary=""
TacticalText=""
AbilityDescName="shotgun"

[PsiAmp_Advent X2WeaponTemplate]
FriendlyName="ADVENT Psi Amp"
FriendlyNamePlural="ADVENT Psi Amps"
BriefSummary=""
TacticalText=""
AbilityDescName="psi amp"

[Sword_Advent X2WeaponTemplate]
FriendlyName="ADVENT Sword"
FriendlyNamePlural="ADVENT Swords"
BriefSummary=""
TacticalText=""
AbilityDescName="sword"

[GrenadeLauncher_Advent X2WeaponTemplate]
FriendlyName="ADVENT Grenade Launcher"
FriendlyNamePlural="ADVENT Grenade Launchers"
BriefSummary=""
TacticalText=""
AbilityDescName="grenade launcher"

[Gremlin_Advent X2WeaponTemplate]
FriendlyName="ADVENT GREMLIN"
FriendlyNamePlural="ADVENT GREMLINS"
BriefSummary=""
TacticalText=""
AbilityDescName="GREMLIN"
